app/controllers/categories_controller.rb

  def index
    @categories = Category.find(:all, :order => "name")
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1