app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "photos"
---
  def index
    @photos = Photo.paginate(page: params[:page])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @photo = Photo.find(params[:id])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "6"]]
---
  def edit
    @photo = Photo.find(params[:id])

INSERT INTO "photos" ("created_at", "filename", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 22 Nov 2012 20:16:34 UTC +00:00], ["filename", "cat.jpg"], ["updated_at", Thu, 22 Nov 2012 20:16:34 UTC +00:00]]
---
  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "photos" SET "thumbnail" = 'balboa_park_thb.jpg', "description" = 'Balboa Park, NY 2012', "updated_at" = '2012-12-20 23:04:16.138369' WHERE "photos"."id" = 1
---
  def update
    @photo = Photo.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])